# Basic Data Processing with Pandas

Pandas (short for “Python Data Analysis Library ”) is a Python package built on top of Numpy.  It is useful for special array handling, data manipulation, plotting, and web scraping.  

Pandas is particularly strong in the area of handling spreadsheet structures, dealing with missing data, and processing time series data.

These are the new data types introduced by pandas (most used ones are in bold):

- **Series**: 1D labeled homogeneously-typed array.
- **DataFrame**: General 2D labeled, size-mutable tabular structure with potentially heterogeneously-typed columns.
- *Time Series*: Series with index containing datetimes.
- *Panel*: General 3D labeled, also size-mutable array.

Import the package, as follows:

In [1]:
import numpy as np
import pandas as pd

## 1. Series

- A series is a one-dimensional array-like object.   
- Each element has an associated data label, called its *index*. By default, the index consists of ordinary array indices, i.e. consecutive integers starting from zero.
### 1.1 Series Operations

In [ ]:
series1 = pd.Series(['Alice', 'Bob', 'Charlie', 'Dahlia'])
series1

In [ ]:
#add a name
series1 = pd.Series(['Alice', 'Bob', 'Charlie', 'Dahlia'], name ='name')
series1

In [ ]:
series1.index  #this is the default index

- An entry can be retrieved using the index, as follows:

In [ ]:
series1[0]

- Often it will be more desirable to create a series with a custom index. 
- Here the index is manually set the index from 101 to 104

In [ ]:
series2 = pd.Series(['Alice', 'Bob', 'Charlie', 'Dahlia'], index=[101, 102, 103, 104])
series2

- Calling that entry gives both values.  In this way a series is different from a dictionary.

In [ ]:
series2.index #custom index

In [ ]:
series2[101]

- The attribute `values` returns all the values.

In [ ]:
series2.values

In [ ]:
series2.values[1]   # obj.values is simply an array

### 1.2 Series and the Dictionary object
#### Dictionaries
Dictionaries are also what they sound like - a list of definitions that correspond to unique terms.

*Keys* and *values* are to a dictionary what words and their definitions are to an English dictionary. 

Each entry in a dictionary is called a key-value pair, and they are bound together by a colon `:` . 

To create a dictionary, use curly braces and declare each key-value pair separated by commas

In [ ]:
student_id = {
    101: 'Alice', # a key-value pair
    102: 'Bob',
    103: 'Charlie',
    104: 'Dahlia',
}
student_id

Similarly to a list, you can use brackets to access the value, but this time with the key (instead of the index)

In [ ]:
student_id[101]

The Series object is similar to a dictionary, `Series.index` is like `dictionary.keys`, and `Series.values` is like `dictionary.values`. Directly convert a dictionary to a Series, as follows:

In [ ]:
series3 = pd.Series(student_id)
series3

Convert a Series back to a dictionary.

In [ ]:
series3.to_dict()

## 2. DataFrame

- A data frame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns.
- Each column can be a different type (integers, strings, floating point numbers, Python objects, etc.).  

### 2.1 Creating DataFrames
A DataFrame may be created using a dict

In [8]:
#declare dict object
data = {'commodity': ['Gold', 'Gold', 'Silver', 'Silver'],
        'year': [2016, 2017, 2018, 2019],
        'production_moz': [107.6, 109.7, 868.3, 886.7]} #world wide in million oz

# convert to DataFrame
df = pd.DataFrame(data)
df

  commodity  year  production_moz
0      Gold  2016           107.6
1      Gold  2017           109.7
2    Silver  2018           868.3
3    Silver  2019           886.7

Heres how it is done using nested lists

In [3]:
df_2=pd.DataFrame([['Gold', 2016, 107.6],
                   ['Gold', 2017, 109.7],
                   ['Silver', 2018, 868.3],
                   ['Silver', 2019, 886.7]], 
                    columns=['commodity','year','production_moz'])
df_2

  commodity  year  production_moz
0      Gold  2016           107.6
1      Gold  2017           109.7
2    Silver  2018           868.3
3    Silver  2019           886.7

The column names can be accessed by

In [4]:
df.columns

Index(['commodity', 'year', 'production_moz'], dtype='object')

It also has an index attribute

In [7]:
df.index #standard index

Index(['Gold', 'Gold', 'Silver', 'Silver'], dtype='object', name='commodity')

- The index may be set using the method `set_index`, as follows:

In [6]:
df=df.set_index('commodity')
df

           year  production_moz
commodity
Gold       2016           107.6
Gold       2017           109.7
Silver     2018           868.3
Silver     2019           886.7

- The dataframe can restore the original index using the mathod `reset_index`, as follows:

In [ ]:
df = df.reset_index()
df

In [ ]:
df.index #custom string index

- The names of columns may be changed as follows:

In [9]:
df.columns=['commodity', 'year','production']
df

  commodity  year  production
0      Gold  2016       107.6
1      Gold  2017       109.7
2    Silver  2018       868.3
3    Silver  2019       886.7

### 2.2. Reading a csv to a Dataframe
Lets read a dataframe from a comma separated values (csv) file

In [12]:
df = pd.read_csv("zoo.csv")
df.sample(20)

      animal    id  water_need  meat_need
16      lion  1017       600.0       35.0
17      lion  1018         NaN       30.0
11     zebra  1012       230.0        NaN
8      zebra  1009       200.0        NaN
9      zebra  1010       220.0        NaN
12     zebra  1013         NaN        NaN
13     zebra  1014       100.0        NaN
7      tiger  1008         NaN       15.0
5      tiger  1006       330.0        NaN
20  kangaroo  1021       430.0        NaN
10     zebra  1011         NaN        NaN
14     zebra  1015        80.0        NaN
2   elephant  1003       550.0        NaN
21  kangaroo  1022       410.0        NaN
6      tiger  1007         NaN       18.0
4      tiger  1005       320.0       20.0
3      tiger  1004       300.0       20.0
19  kangaroo  1020       410.0        NaN
18      lion  1019       390.0       30.0
1   elephant  1002       600.0        NaN

Some initial methods to check the read file

In [ ]:
len(df)   #how many rows?

In [ ]:
df.head()      #check first 5 rows

In [ ]:
df.tail()  #check last 5 rows

In [ ]:
df.info() #shows number of non-empty entries per column

In [11]:
df.shape  #outputs (number of rows, number of columns)

(22, 4)

### 2.3 Slicing a DataFrame

#### 2.3.1. By Column
Columns may be examined one-by-one using brackets. The result may be written as a series or a dataframe

In [13]:
df['animal'] #this yields a pandas series

0     elephant
1     elephant
2     elephant
3        tiger
4        tiger
5        tiger
6        tiger
7        tiger
8        zebra
9        zebra
10       zebra
11       zebra
12       zebra
13       zebra
14       zebra
15        lion
16        lion
17        lion
18        lion
19    kangaroo
20    kangaroo
21    kangaroo
Name: animal, dtype: object

A hunch may be confirmed on why accessing columns return Series objects -- this is exactly because a dataframe is a combination of Series objects! 
![Series + Series = DataFrame](https://raw.githubusercontent.com/dhrunlauwers/teaching-challenge/master/lesson-material/images/series-and-dataframe.png )

In [14]:
df[['animal']].head() #this yields a pandas data frame

     animal
0  elephant
1  elephant
2  elephant
3     tiger
4     tiger

In [15]:
df.animal       # retrieve by attribute

0     elephant
1     elephant
2     elephant
3        tiger
4        tiger
5        tiger
6        tiger
7        tiger
8        zebra
9        zebra
10       zebra
11       zebra
12       zebra
13       zebra
14       zebra
15        lion
16        lion
17        lion
18        lion
19    kangaroo
20    kangaroo
21    kangaroo
Name: animal, dtype: object

In [16]:
df[['animal','water_need']]   #get 2 columns

      animal  water_need
0   elephant       500.0
1   elephant       600.0
2   elephant       550.0
3      tiger       300.0
4      tiger       320.0
5      tiger       330.0
6      tiger         NaN
7      tiger         NaN
8      zebra       200.0
9      zebra       220.0
10     zebra         NaN
11     zebra       230.0
12     zebra         NaN
13     zebra       100.0
14     zebra        80.0
15      lion       420.0
16      lion       600.0
17      lion         NaN
18      lion       390.0
19  kangaroo       410.0
20  kangaroo       430.0
21  kangaroo       410.0

#### 2.3.2 By Row

Rows may be selected using the `.loc` command

In [22]:
df.loc[:2]

     animal    id  water_need  meat_need
0  elephant  1001       500.0        NaN
1  elephant  1002       600.0        NaN
2  elephant  1003       550.0        NaN

This is quite useful when using customized indices

In [18]:
df2 = df.set_index('id')
df2

        animal  water_need  meat_need
id
1001  elephant       500.0        NaN
1002  elephant       600.0        NaN
1003  elephant       550.0        NaN
1004     tiger       300.0       20.0
1005     tiger       320.0       20.0
1006     tiger       330.0        NaN
1007     tiger         NaN       18.0
1008     tiger         NaN       15.0
1009     zebra       200.0        NaN
1010     zebra       220.0        NaN
1011     zebra         NaN        NaN
1012     zebra       230.0        NaN
1013     zebra         NaN        NaN
1014     zebra       100.0        NaN
1015     zebra        80.0        NaN
1016      lion       420.0       25.0
1017      lion       600.0       35.0
1018      lion         NaN       30.0
1019      lion       390.0       30.0
1020  kangaroo       410.0        NaN
1021  kangaroo       430.0        NaN
1022  kangaroo       410.0        NaN

In [19]:
df2.loc[1011]#id number and series

animal        zebra
water_need      NaN
meat_need       NaN
Name: 1011, dtype: object

In [20]:
df2.loc[[1011,1012,1013]]#dataframe

     animal  water_need  meat_need
id
1011  zebra         NaN        NaN
1012  zebra       230.0        NaN
1013  zebra         NaN        NaN

For dataframes with custom index, the index locator `.iloc` or the simple bracket indexer `[]` might be more helpful

In [23]:
df2[5:10]

     animal  water_need  meat_need
id
1006  tiger       330.0        NaN
1007  tiger         NaN       18.0
1008  tiger         NaN       15.0
1009  zebra       200.0        NaN
1010  zebra       220.0        NaN

In [24]:
df2.iloc[5:10]

     animal  water_need  meat_need
id
1006  tiger       330.0        NaN
1007  tiger         NaN       18.0
1008  tiger         NaN       15.0
1009  zebra       200.0        NaN
1010  zebra       220.0        NaN

#### 2.3.3 Custom Slicing

In [ ]:
df['animal'][2]#index 2

In [25]:
df['water_need'][1:3]#1st and 2nd normal index & series

1    600.0
2    550.0
Name: water_need, dtype: float64

In [26]:
df[['animal','water_need']][1:3]#dataframe

     animal  water_need
1  elephant       600.0
2  elephant       550.0

In [27]:
# select as a matrix 
df.iloc[1:5]

     animal    id  water_need  meat_need
1  elephant  1002       600.0        NaN
2  elephant  1003       550.0        NaN
3     tiger  1004       300.0       20.0
4     tiger  1005       320.0       20.0

In [28]:
# select as a matrix 
df.iloc[1:5,2]#index 2 which is water need

1    600.0
2    550.0
3    300.0
4    320.0
Name: water_need, dtype: float64

### 2.4 Sorting a DataFrame
- It is possible to order the rows of data frames using `sort_values()`.  This object method takes a column name as an argument.
- It is used on the new_features data frame to order by date of inception, as follows:

In [30]:
df.sort_values('water_need').head()

   animal    id  water_need  meat_need
14  zebra  1015        80.0        NaN
13  zebra  1014       100.0        NaN
8   zebra  1009       200.0        NaN
9   zebra  1010       220.0        NaN
11  zebra  1012       230.0        NaN

By default the sort is done in ascending order.  To apply the sort in decending order, set the `ascending` parameter to `False`.

In [31]:
df.sort_values('water_need',ascending=False)

      animal    id  water_need  meat_need
1   elephant  1002       600.0        NaN
16      lion  1017       600.0       35.0
2   elephant  1003       550.0        NaN
0   elephant  1001       500.0        NaN
20  kangaroo  1021       430.0        NaN
15      lion  1016       420.0       25.0
19  kangaroo  1020       410.0        NaN
21  kangaroo  1022       410.0        NaN
18      lion  1019       390.0       30.0
5      tiger  1006       330.0        NaN
4      tiger  1005       320.0       20.0
3      tiger  1004       300.0       20.0
11     zebra  1012       230.0        NaN
9      zebra  1010       220.0        NaN
8      zebra  1009       200.0        NaN
13     zebra  1014       100.0        NaN
14     zebra  1015        80.0        NaN
6      tiger  1007         NaN       18.0
7      tiger  1008         NaN       15.0
10     zebra  1011         NaN        NaN
12     zebra  1013         NaN        NaN
17      lion  1018         NaN       30.0

### 2.5 Filtering a DataFrame
First, lets see what happens to a Series object under a conditional

In [32]:
df['water_need']>=200 #series object and boolean

0      True
1      True
2      True
3      True
4      True
5      True
6     False
7     False
8      True
9      True
10    False
11     True
12    False
13    False
14    False
15     True
16     True
17    False
18     True
19     True
20     True
21     True
Name: water_need, dtype: bool

A DataFrame may be filtered by passing this Series of booleans into the bracket operator

In [33]:
df[df['water_need']>200] #change within the dataframe

      animal    id  water_need  meat_need
0   elephant  1001       500.0        NaN
1   elephant  1002       600.0        NaN
2   elephant  1003       550.0        NaN
3      tiger  1004       300.0       20.0
4      tiger  1005       320.0       20.0
5      tiger  1006       330.0        NaN
9      zebra  1010       220.0        NaN
11     zebra  1012       230.0        NaN
15      lion  1016       420.0       25.0
16      lion  1017       600.0       35.0
18      lion  1019       390.0       30.0
19  kangaroo  1020       410.0        NaN
20  kangaroo  1021       430.0        NaN
21  kangaroo  1022       410.0        NaN

You may also combine the conditionals

In [34]:
df[(df['water_need']>200)&(df['animal']=='tiger')] #subsetting in python ez

  animal    id  water_need  meat_need
3  tiger  1004       300.0       20.0
4  tiger  1005       320.0       20.0
5  tiger  1006       330.0        NaN

`.between` is a convenient way to filter within a range

In [35]:
df[(df['water_need'].between(300,500))] #equivalent to df[(df['water_need']>300)&(df['water_need']<500)]

      animal    id  water_need  meat_need
0   elephant  1001       500.0        NaN
3      tiger  1004       300.0       20.0
4      tiger  1005       320.0       20.0
5      tiger  1006       330.0        NaN
15      lion  1016       420.0       25.0
18      lion  1019       390.0       30.0
19  kangaroo  1020       410.0        NaN
20  kangaroo  1021       430.0        NaN
21  kangaroo  1022       410.0        NaN

`isin` is a convenient way of filtering given a lookup list

In [36]:
df[(df['water_need'].between(300,500))&(df['animal'].isin(['tiger','lion']))] #equivalent to df[(df['water_need']>300)&(df['water_need']<500)]

   animal    id  water_need  meat_need
3   tiger  1004       300.0       20.0
4   tiger  1005       320.0       20.0
5   tiger  1006       330.0        NaN
15   lion  1016       420.0       25.0
18   lion  1019       390.0       30.0

### 2.6 Removing and Adding entries in a Dataframe

#### 2.6.1 Removing methods

In [37]:
#this removes row 'two'
df.loc[df.index != 2]

      animal    id  water_need  meat_need
0   elephant  1001       500.0        NaN
1   elephant  1002       600.0        NaN
3      tiger  1004       300.0       20.0
4      tiger  1005       320.0       20.0
5      tiger  1006       330.0        NaN
6      tiger  1007         NaN       18.0
7      tiger  1008         NaN       15.0
8      zebra  1009       200.0        NaN
9      zebra  1010       220.0        NaN
10     zebra  1011         NaN        NaN
11     zebra  1012       230.0        NaN
12     zebra  1013         NaN        NaN
13     zebra  1014       100.0        NaN
14     zebra  1015        80.0        NaN
15      lion  1016       420.0       25.0
16      lion  1017       600.0       35.0
17      lion  1018         NaN       30.0
18      lion  1019       390.0       30.0
19  kangaroo  1020       410.0        NaN
20  kangaroo  1021       430.0        NaN
21  kangaroo  1022       410.0        NaN

In [38]:
#this removes column 'a'
df.drop('animal', axis = 1)#axis 1 ay column

      id  water_need  meat_need
0   1001       500.0        NaN
1   1002       600.0        NaN
2   1003       550.0        NaN
3   1004       300.0       20.0
4   1005       320.0       20.0
5   1006       330.0        NaN
6   1007         NaN       18.0
7   1008         NaN       15.0
8   1009       200.0        NaN
9   1010       220.0        NaN
10  1011         NaN        NaN
11  1012       230.0        NaN
12  1013         NaN        NaN
13  1014       100.0        NaN
14  1015        80.0        NaN
15  1016       420.0       25.0
16  1017       600.0       35.0
17  1018         NaN       30.0
18  1019       390.0       30.0
19  1020       410.0        NaN
20  1021       430.0        NaN
21  1022       410.0        NaN

In [39]:
#remove all rows with tiger
df.loc[df['animal'] != 'tiger']

      animal    id  water_need  meat_need
0   elephant  1001       500.0        NaN
1   elephant  1002       600.0        NaN
2   elephant  1003       550.0        NaN
8      zebra  1009       200.0        NaN
9      zebra  1010       220.0        NaN
10     zebra  1011         NaN        NaN
11     zebra  1012       230.0        NaN
12     zebra  1013         NaN        NaN
13     zebra  1014       100.0        NaN
14     zebra  1015        80.0        NaN
15      lion  1016       420.0       25.0
16      lion  1017       600.0       35.0
17      lion  1018         NaN       30.0
18      lion  1019       390.0       30.0
19  kangaroo  1020       410.0        NaN
20  kangaroo  1021       430.0        NaN
21  kangaroo  1022       410.0        NaN

- Rows and columns may also be removed using fancy indexing or `drop()`.

#### 2.6.2 Adding methods

In [40]:
#this adds a row at the end of the dataset
df.loc[len(df)] = ['zookeper',0000,50,3] #len(df) ay new row
df

      animal    id  water_need  meat_need
0   elephant  1001       500.0        NaN
1   elephant  1002       600.0        NaN
2   elephant  1003       550.0        NaN
3      tiger  1004       300.0       20.0
4      tiger  1005       320.0       20.0
5      tiger  1006       330.0        NaN
6      tiger  1007         NaN       18.0
7      tiger  1008         NaN       15.0
8      zebra  1009       200.0        NaN
9      zebra  1010       220.0        NaN
10     zebra  1011         NaN        NaN
11     zebra  1012       230.0        NaN
12     zebra  1013         NaN        NaN
13     zebra  1014       100.0        NaN
14     zebra  1015        80.0        NaN
15      lion  1016       420.0       25.0
16      lion  1017       600.0       35.0
17      lion  1018         NaN       30.0
18      lion  1019       390.0       30.0
19  kangaroo  1020       410.0        NaN
20  kangaroo  1021       430.0        NaN
21  kangaroo  1022       410.0        NaN
22  zookeper     0        50.0        3.0

In [41]:
#add a column with constant value
df['is_alive'] = True
df

      animal    id  water_need  meat_need  is_alive
0   elephant  1001       500.0        NaN      True
1   elephant  1002       600.0        NaN      True
2   elephant  1003       550.0        NaN      True
3      tiger  1004       300.0       20.0      True
4      tiger  1005       320.0       20.0      True
5      tiger  1006       330.0        NaN      True
6      tiger  1007         NaN       18.0      True
7      tiger  1008         NaN       15.0      True
8      zebra  1009       200.0        NaN      True
9      zebra  1010       220.0        NaN      True
10     zebra  1011         NaN        NaN      True
11     zebra  1012       230.0        NaN      True
12     zebra  1013         NaN        NaN      True
13     zebra  1014       100.0        NaN      True
14     zebra  1015        80.0        NaN      True
15      lion  1016       420.0       25.0      True
16      lion  1017       600.0       35.0      True
17      lion  1018         NaN       30.0      True
18      lion  1019       390.0       30.0      True
19  kangaroo  1020       410.0        NaN      True
20  kangaroo  1021       430.0        NaN      True
21  kangaroo  1022       410.0        NaN      True
22  zookeper     0        50.0        3.0      True

### 2.7 DataFrame Aggregations
We can take some basic stats on the dataframe

In [42]:
df['water_need'].mean()

341.1111111111111

In [43]:
df['water_need'].median()

360.0

In [44]:
df[df['animal']=='elephant']['water_need'].mean()

550.0

In [ ]:
#reset
df = pd.read_csv("zoo.csv")

### 2.8 Handling Missing Data

- Missing or, equivalently, corrupt data is an unavoidable reality in processing large data sets.  There are various ways of dealing with it, depending upon the circumstances:
 - Discard it, and all related data.
 - Interpolate values from surrounding data
 - Isolate it and analyze it separately

- Which approach to use is a scientific question.  Whatever approach is chosen, pandas has computational methods to carry it out.

- To figure out where the missing data is, use the `isnull()` method.

In [ ]:
df.isnull()

- Summing up the boolean array reports how many missing values are in each column.

In [45]:
np.sum(df.isnull())

animal         0
id             0
water_need     5
meat_need     14
is_alive       0
dtype: int64

- To isolate the rows in which there are null values, aggregate the `df.isnull()` boolean data frame along rows, using `any` with `axis=1`.

In [46]:
df.loc[df.isnull().any(axis=1)] #rows at least may isang null

      animal    id  water_need  meat_need  is_alive
0   elephant  1001       500.0        NaN      True
1   elephant  1002       600.0        NaN      True
2   elephant  1003       550.0        NaN      True
5      tiger  1006       330.0        NaN      True
6      tiger  1007         NaN       18.0      True
7      tiger  1008         NaN       15.0      True
8      zebra  1009       200.0        NaN      True
9      zebra  1010       220.0        NaN      True
10     zebra  1011         NaN        NaN      True
11     zebra  1012       230.0        NaN      True
12     zebra  1013         NaN        NaN      True
13     zebra  1014       100.0        NaN      True
14     zebra  1015        80.0        NaN      True
17      lion  1018         NaN       30.0      True
19  kangaroo  1020       410.0        NaN      True
20  kangaroo  1021       430.0        NaN      True
21  kangaroo  1022       410.0        NaN      True

- If you want to isolate only those `_need` rows with all null columns, use `all` instead, with `axis=1`.

In [47]:
df.loc[df[['water_need','meat_need']].isnull().all(axis=1)]

   animal    id  water_need  meat_need  is_alive
10  zebra  1011         NaN        NaN      True
12  zebra  1013         NaN        NaN      True

We can drop the rows with nulls

In [48]:
df.loc[~df.isnull().any(axis=1)] #deselect

      animal    id  water_need  meat_need  is_alive
3      tiger  1004       300.0       20.0      True
4      tiger  1005       320.0       20.0      True
15      lion  1016       420.0       25.0      True
16      lion  1017       600.0       35.0      True
18      lion  1019       390.0       30.0      True
22  zookeper     0        50.0        3.0      True


An alternative to discarding information is to **impute** the data. 
This can be done with the `fillna()` function with the value to be imputed as the argument.

In [49]:
df['meat_need'].fillna(0)

0      0.0
1      0.0
2      0.0
3     20.0
4     20.0
5      0.0
6     18.0
7     15.0
8      0.0
9      0.0
10     0.0
11     0.0
12     0.0
13     0.0
14     0.0
15    25.0
16    35.0
17    30.0
18    30.0
19     0.0
20     0.0
21     0.0
22     3.0
Name: meat_need, dtype: float64

Another common way to impute is by the mean of the column.

In [50]:
df['water_need'].fillna(df['water_need'].mean())

0     500.000000
1     600.000000
2     550.000000
3     300.000000
4     320.000000
5     330.000000
6     341.111111
7     341.111111
8     200.000000
9     220.000000
10    341.111111
11    230.000000
12    341.111111
13    100.000000
14     80.000000
15    420.000000
16    600.000000
17    341.111111
18    390.000000
19    410.000000
20    430.000000
21    410.000000
22     50.000000
Name: water_need, dtype: float64

### Exercise

Read the csv 'employees.csv'

Print the data frame, looking for missing values by inspection.

In [ ]:
### Your code here
df = pd.read_csv('employees.csv')
df

See '?' in the data frame. For a small data frame like this the '?' may be replaced by `np.nan` manually. In dealing with a large data frame, it is more efficient to use the function `replace`. https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.replace.html

Use `replace` to swap '?' with `np.nan`.

In [ ]:
#### Your code here

Print the rows with missing values.

In [ ]:
#### Your code here

Print the columns with missing values.

In [ ]:
#### Your code here

Filter all employees listed with Masters degree

In [ ]:
#### Your code here

Get the average salary of the IT Department

In [ ]:
#### Your code here

Get the average years of the HR Department

In [ ]:
#### Your code here